#/bin/bash

case $1 in
    1)
        echo "Дано натуральное число n. Подсчитать количество цифр и нулей";
    ;;
    3)
        echo "Дана последовательность из n целых элементов. Сформировать две новых последовательности, состоящих соответственно из положительных и отрицательных элементов исходной последовательности. Элементы в результирующих последовательностях должны быть отсортированы по убыванию. Все последовательности: исходную и полученные вывести на экран.";
    ;;
    33)
        echo "Дана последовательность из n целых элементов. Сформировать две новых последовательности, состоящих соответственно из четных и нечетных (по значению) элементов исходной последовательности. Элементы в результирующих последовательностях должны быть отсортированы по убыванию. Все последовательности: исходную и полученные вывести на экран.";
    ;;
    *)
        echo ""
    ;;
esac

